#+TITLE:Supporting Information: Identifying Potential BO_{2} Oxide Polymorphs for Epitaxial Growth Candidates

#+LATEX_CLASS: achemso
#+LATEX_CLASS_OPTIONS: [journal=aamick,manuscript=article,email=true]
#+latex_header: \setkeys{acs}{biblabel=brackets,super=true,articletitle=true}
#+latex_header: \SectionNumbersOn

#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: author:nil date:nil

#+latex_header: \author{Prateek Mehta}
#+latex_header: \affiliation{Department of Chemical Engineering, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213}

#+latex_header:\author{Paul A. Salvador}
#+latex_header:\affiliation{Department of Materials Science and Engineering, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213}

#+latex_header: \author{John R. Kitchin}
#+latex_header: \email{jkitchin@andrew.cmu.edu}
#+latex_header: \affiliation{Department of Chemical Engineering, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213}



\newpage

\maketitle

\raggedbottom

* Computational Details of a Calculation
Here is an example of opening the JSON file, and printing the calculation details for one calculation, in this case the final geometry optimization for TiO_2 in the anatase polymorph, using the AM05 functional. We print the INCAR parameters used in the VASP calculations, the other input parameters such as the /k/-point grid, the POTCARs used, the final cell parameters, and other data saved from the calculation.
#+BEGIN_SRC python
import json
import numpy as np

with open('supporting-information.json', 'rb') as f:
    d = json.loads(f.read())

calc = d['TiO2']['anatase']['AM05']['final']['calculations'][0]

print 'INCAR:'
for key, val in calc['incar'].items():
    print '{0} = {1}'.format(key, val)

print
print 'OTHER INPUT:'
for key, val in calc['input'].items():
    print '{0} = {1}'.format(key, val)

print
print 'POTCARS:'
for sym,potcar, githash in calc['potcar']:
    print sym, potcar, githash

print
# information about the geometry
print 'cell:\n', np.array(calc['atoms']['cell'])
print 'positions: \n',
for sym, pos in zip(calc['atoms']['symbols'], calc['atoms']['positions']):
    print sym, pos

print
print 'output:'
for key, val in calc['data'].items():
    if key == 'forces':
	print 'forces = \n', np.array(val)
    else:
	print '{0} = {1}'.format(key, val)

#+END_SRC

#+RESULTS:
#+begin_example
INCAR:
doc = INCAR parameters
prec = Normal
isif = 3
ibrion = 2
gga = AM
encut = 520.0
ismear = 0
nbands = 20
sigma = 0.001
nsw = 50

OTHER INPUT:
kpts = [6, 6, 6]
reciprocal = False
xc = LDA
kpts_nintersections = None
setups = None
txt = -
gamma = False
POTCARS:
O potpaw/O/POTCAR 0cf2ce56049ca395c567026b700ed66c94a85161
Ti potpaw/Ti/POTCAR 51f7f05982d6b4052becc160375a8b8b670177a7

cell:
[[ 3.79437818  0.          0.        ]
 [ 0.          3.79437818  0.        ]
 [ 1.89718909  1.89718909  4.76872776]]
positions:
Ti [3.794378179384281, 2.845783634538211, 1.1921819398322235]
Ti [1.8971890896921404, 2.8457836345382104, 3.576545819496671]
O [3.794378179384281, 0.9485945448460702, 0.7914922560042584]
O [3.7943781793842803, 2.8457836345382104, 3.175856135668705]
O [1.8971890896921406, 4.742972724230351, 3.977235503324636]
O [1.8971890896921404, 2.845783634538211, 1.5928716236601885]

output:
stress = [0.09592973, 0.09592973, 1.57774819, 0.0, 0.0, 0.0]
doc = Data from the output of the calculation
volume = 68.6568316763
total_energy = -56.819327
forces =
[[ 0.        0.        0.      ]
 [ 0.        0.        0.      ]
 [ 0.        0.       -0.021397]
 [ 0.        0.       -0.021397]
 [ 0.        0.        0.021397]
 [ 0.        0.        0.021397]]
fermi_level = 0.7851
#+end_example

These results could have been read by hand from the JSON file, but it should be clear now that a machine can read them, and could even recreate the actual INCAR, KPOINTS, POSCAR and POTCAR files needed to rerun this calculation exactly the way it was done by us.

* $k$-point Grids \label{sec:k-pt}
Here we have a Python code block that reads the Monkhorst point $k$-point grids for each oxide polymorph from the JSON file and prints them in Table ref:table:k-pts.
#+ATTR_LATEX: :placement [H]
#+BEGIN_SRC python

import json
with open('supporting-information.json', 'rb') as f:
    d = json.loads(f.read())

print '#+caption: Monkhorst Point $k$-point meshes of all polymorphs of all oxides in this work label:table:k-pts'
print '|Oxide|Polymorph|$k$-point grid|'

	  # oxide, latex key
oxides = [['TiO2','TiO$_2$'],
	  ['VO2','VO$_2$'],
	  ['RuO2','RuO$_2$'],
	  ['IrO2','IrO$_2$'],
	  ['SnO2','SnO$_2$']]
for BO2,key in oxides:

    print '|-'
    for polymorph in ['rutile',
		      'anatase',
		      'brookite',
		      'columbite',
		      'pyrite',
		      'fluorite']:
	# k-points are consistent across functionals - we use LDA here
	k1,k2,k3= d[BO2][polymorph]['LDA']['final']['calculations'][0]['input']['kpts']
	print '|{0}|{1}|${2}\\times{3}\\times{4}$|'.format(key,polymorph,k1,k2,k3)

#+END_SRC

#+RESULTS:
#+ATTR_LATEX: :font \scriptsize :placement [H]
#+caption: Monkhorst Point $k$-point meshes of all polymorphs of all oxides in this work label:table:k-pts
| Oxide   | Polymorph | $k$-point grid       |
|---------+-----------+----------------------|
| TiO$_2$ | rutile    | $6\times6\times6$    |
| TiO$_2$ | anatase   | $6\times6\times6$    |
| TiO$_2$ | brookite  | $6\times6\times6$    |
| TiO$_2$ | columbite | $6\times6\times6$    |
| TiO$_2$ | pyrite    | $6\times6\times6$    |
| TiO$_2$ | fluorite  | $4\times4\times4$    |
|---------+-----------+----------------------|
| VO$_2$  | rutile    | $6\times6\times6$    |
| VO$_2$  | anatase   | $16\times16\times16$ |
| VO$_2$  | brookite  | $6\times6\times6$    |
| VO$_2$  | columbite | $6\times6\times6$    |
| VO$_2$  | pyrite    | $6\times6\times6$    |
| VO$_2$  | fluorite  | $6\times6\times6$    |
|---------+-----------+----------------------|
| RuO$_2$ | rutile    | $6\times6\times6$    |
| RuO$_2$ | anatase   | $6\times6\times6$    |
| RuO$_2$ | brookite  | $8\times8\times8$    |
| RuO$_2$ | columbite | $6\times6\times6$    |
| RuO$_2$ | pyrite    | $8\times8\times8$    |
| RuO$_2$ | fluorite  | $6\times6\times6$    |
|---------+-----------+----------------------|
| IrO$_2$ | rutile    | $6\times6\times6$    |
| IrO$_2$ | anatase   | $7\times7\times7$    |
| IrO$_2$ | brookite  | $8\times8\times8$    |
| IrO$_2$ | columbite | $6\times6\times6$    |
| IrO$_2$ | pyrite    | $6\times6\times6$    |
| IrO$_2$ | fluorite  | $6\times6\times6$    |
|---------+-----------+----------------------|
| SnO$_2$ | rutile    | $8\times8\times8$    |
| SnO$_2$ | anatase   | $8\times8\times8$    |
| SnO$_2$ | brookite  | $8\times8\times8$    |
| SnO$_2$ | columbite | $8\times8\times8$    |
| SnO$_2$ | pyrite    | $8\times8\times8$    |
| SnO$_2$ | fluorite  | $8\times8\times8$    |



* build :noexport:

#+BEGIN_SRC emacs-lisp :results output
(let ((org-latex-classes '(("achemso"                          ;class-name
			    "\\documentclass{achemso}"        ; header-string
			    ("\\section{%s}" . "\\section*{%s}")
			    ("\\subsection{%s}" . "\\subsection*a{%s}")
			    ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
			    ("\\paragraph{%s}" . "\\paragraph*{%s}")
			    ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
      (org-latex-title-command "") ; avoids getting \maketitle right after begin{document}
      ;; these packages are loaded in the latex file
      (org-latex-default-packages-alist
       '(("utf8" "inputenc" nil)
	 ("T1" "fontenc" nil)
	 ("" "fixltx2e" nil)
         ("" "longtable" nil)
	 ("" "natbib" t)
	 ("" "url" t)
	 ("" "minted" t)
	 ("" "float" t)
	 ("" "graphicx" t)
         ("" "textcomp" t)
         ("" "underscore" t)
	 ("" "amsmath" t)
	 ("linktocpage,
  pdfstartview=FitH,
  colorlinks,
  linkcolor=blue,
  anchorcolor=blue,
  citecolor=blue,
  filecolor=blue,
  menucolor=blue,
  urlcolor=blue" "hyperref" t)
             ("" "attachfile" t)))
      (org-latex-listings 'minted)
      (org-latex-minted-options
           '(("frame" "lines")
             ("fontsize" "\\scriptsize")
             ("linenos" "")))
      (async nil)
      (subtreep nil)
      (visible-only nil)
      (body-only nil))

  (org-latex-export-to-latex async subtreep visible-only body-only
			     '(:with-author nil
			       :with-date nil
			       :with-title nil
			       :with-toc nil)))

(progn
  (shell-command "pdflatex -shell-escape supporting-information")
  (shell-command "bibtex manuscript")
  (shell-command "pdflatex -shell-escape supporting-information")
  (shell-command "pdflatex -shell-escape supporting-information"))

(save-buffer)
(princ "manuscript is built"))
#+END_SRC

#+RESULTS:
: manuscript is built
